<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"test-plan colours","backend":"c190fa6afa7c4124d64b2cb65435b528e8dcb7ef861e2bdc2f14e596f6e9acc7","plan_job_ref":"Job Test terraform-plan #711 at https://github.com/dflook/terraform-github-actions/actions/runs/13593327839","plan_out_hash":"8f6c457ebb3c6bf8de4f6a579ed789c56be5b841b5dae3a8581c32c2989c7a8d","plan_hash":"4fae14cbd3784bcd0de0bb0b9d38b7f07517ee7ff7f7ceafb4633133c6798f65","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan for __test-plan colours__
<details>
<summary>Plan: 3 to add, 1 to change, 3 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_s3_object.update will be updated in-place
!~  resource "aws_s3_object" "update" {
!~      content                = "hello" -> "update"
        id                     = "test-plan-colours-test-object"
        tags                   = {}
+       version_id             = (known after apply)
#        (11 unchanged attributes hidden)
    }

  # random_string.add[0] will be created
+   resource "random_string" "add" {
+       id          = (known after apply)
+       length      = 3
+       lower       = true
+       min_lower   = 0
+       min_numeric = 0
+       min_special = 0
+       min_upper   = 0
+       number      = true
+       numeric     = true
+       result      = (known after apply)
+       special     = true
+       upper       = true
    }

  # random_string.create_before_delete must be replaced
+/- resource "random_string" "create_before_delete" {
!~      id          = "****" -> (known after apply)
!~      length      = 4 -> 3 # forces replacement
!~      result      = "****" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

  # random_string.delete[0] will be destroyed
  # (because index [0] is out of range for count)
-   resource "random_string" "delete" {
-       id          = "02g" -> null
-       length      = 3 -> null
-       lower       = true -> null
-       min_lower   = 0 -> null
-       min_numeric = 0 -> null
-       min_special = 0 -> null
-       min_upper   = 0 -> null
-       number      = true -> null
-       numeric     = true -> null
-       result      = "02g" -> null
-       special     = true -> null
-       upper       = true -> null
    }

  # random_string.delete_before_create must be replaced
-/+ resource "random_string" "delete_before_create" {
!~      id          = "***" -> (known after apply)
!~      length      = 3 -> 4 # forces replacement
!~      result      = "***" -> (known after apply)
#        (9 unchanged attributes hidden)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

Changes to Outputs:
+   add    = "hello"
-   delete = "goodbye" -> null
!~  update = "hello" -> "update"
```
</details>

:memo: Plan generated in [Test terraform-plan #711](https://github.com/dflook/terraform-github-actions/actions/runs/13593327839)